Конфигурация/src/Documents/НазначениеПреподавателя/НазначениеПреподавателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НазначениеПреподавателя</name>
  <registerRecords>InformationRegister.ЗакреплениеДисциплинЗаПреподавателями</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Назначения</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.Преподаватели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятия</name>
      <type>
        <types>CatalogRef.ВидыЗанятий</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/InformationRegisters/ЗакреплениеДисциплинЗаПреподавателями/ЗакреплениеДисциплинЗаПреподавателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗакреплениеДисциплинЗаПреподавателями</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <dimensions>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗанятия</name>
    <type>
      <types>CatalogRef.ВидыЗанятий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/Documents/НазначениеПреподавателя/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ЗакреплениеДисциплинЗаПреподавателями.Записывать = Истина;

	Для Каждого СтрокаНазначения Из Назначения Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаНазначения.УчебнаяГруппа) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаНазначения.Дисциплина) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаНазначения.Преподаватель) Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.ЗакреплениеДисциплинЗаПреподавателями.Добавить();
		Движение.Период = Дата;
		Движение.УчебнаяГруппа = СтрокаНазначения.УчебнаяГруппа;
		Движение.Дисциплина = СтрокаНазначения.Дисциплина;
		Движение.ВидЗанятия = СтрокаНазначения.ВидЗанятия;
		Движение.Преподаватель = СтрокаНазначения.Преподаватель;
		Движение.КоличествоЧасов = СтрокаНазначения.КоличествоЧасов;
		Движение.УчебныйПериод = УчебныйПериод;

	КонецЦикла;

КонецПроцедуры
